Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཞེས་བྱའོ། །འདི་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ཞེས་བྱའོ་ཞེས་ཆོས་སྟོན་ཏོ། །རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ། སྒྱུ་མ་བྱེད་པའི་མཆན་བུ་མཁས་པ་ཞིག་གིས་རྫས་ཀྱི་རྣམ་པ་གྱི་ན་ཞིག་ལ་བརྟེན་ཏེ། གཟུགས་ཀྱི་བྱེ་བྲག་སྣ་ཚོགས་འདི་ལྟ་སྟེ། གླང་པོའི་གཟུགས་སམ། རྟའི་གཟུགས་སམ། བ་ལང་གི་གཟུགས་སམ། རྔ་མོ་དང་། ལུག་གི་གཟུགས་སམ། སྐྱེས་པ་དང་། བུད་མེད་དང་།
en: These are [the goals], up to and including unsurpassed, complete enlightenment.’ “

source: ཁྱེའུ་དང་བུ་མོའི་གཟུགས་སམ། སྐྱེད་མོས་ཚལ་དང་། གཞལ་མེད་ཁང་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། ཀུན་དགའི་ར་བ་མདངས་དགའ་བ་འམ། རྫིང་བུ་མདངས་དགའ་བ་འམ། ནགས་ཚལ་མདངས་དགའ་བ་དག་སྤྲུལ་ཅིང་། དེ་དག་ཏུ་སྟན་དང་། འཁོར་གྱི་སྟན་དང་། གཞི་རྣམ་པ་སྣ་ཚོགས་བཏིང་སྟེ། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་བྱུག་པ་དང་། ཁ་ཟས་དང་། སྤྱན་གཟིགས་ཞིམ་པོ་དག་བསྟན་ཏམ། གླུ་དང་སིལ་སྙན་གྱིས་སྐྱེ་བོ་དགའ་བར་བྱས་སམ། སྦྱིན་པ་ཡོངས་སུ་གཏང་བ་འམ། ཚུལ་ཁྲིམས་བསྲུང་བ་འམ། བཟོད་པ་བསྒྲུབ་པ་འམ། བརྩོན་འགྲུས་བརྩམ་པ་འམ། ཏིང་ངེ་འཛིན་གྱིས་རྣམ་པར་རྩེ་བ་འམ། ཤེས་རབ་བསྒོམ་པ་འམ། རྣམ་པ་དེ་ལྟ་བུ་དག་གིས་སྐྱེ་བོ་དགའ་བར་བྱས་ཏེ། རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་བསྟན་ཏམ། བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་བསྟན་ཏམ། རི་རབ་བསྟན་ཏམ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་བསྟན་ཏམ། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་སྣང་བ་དང་ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་དགེ་རྒྱས་དང་། ཆེ་བ་དང་ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བའི་ལྷ་རྣམས་བསྟན་ཏམ། མི་གདུང་བའི་ལྷ་རྣམས་དང་། ཤིན་དུ་མཐོང་བའི་ལྷ་རྣམས་དང་། གྱ་ནོམ་སྣང་བའི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་བསྟན་ཏམ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་གཟུགས་མེད་པ་རྣམས་བསྟན་ཏམ། རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་མང་པོ་བསྟན་ཏམ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་ལ་སྤྱོད་པ་དང་། ས་དང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། ས་བཅུ་པའི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་དང་། མངོན་པར་ཤེས་པ་མངོན་པར་བསྒྲུབ་པ་དང་། མངོན་པར་ཤེས་པ་དེ་དག་གིས་རྣམ་པར་རྩེ་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་སྣང་བར་བྱེད་པ་དང་།
en: Subhūti, this is just as if an illusionist or the skilled apprentice of an illusionist, based on some material form, were to conjure a diversity of other forms, including the form of an elephant, the form of a horse, the form of a bull, the form of a camel, the form of a sheep, the form of a man, the form of a woman, or the form of a boy or girl, or a meadow, a palace, a forest of austere practitioners, or a pleasant monastic garden, or a pleasant pool, or a pleasant grove—and if in those same places he were then to lay out a diversity of mats with seats and places for the assembly, and even exhibit flowers, garlands, incense, unguents, food, and other such exquisite spectacles; and if he were to delight the crowd with songs and music, or delight the crowd by dispensing generosity, keeping [the vows of] ethical discipline, cultivating tolerance, undertaking perseverance, playing with meditative concentration, cultivating wisdom, or any such means—and even if [through these illusions], he were to exhibit great and lofty royal families, great and lofty priestly families, or great and lofty householder families; or exhibit Mount Sumeru; or exhibit the gods of the Caturmahā­rāja­kāyika realm; or exhibit the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha; or exhibit the formless gods of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, or the sphere of neither perception nor nonperception; or exhibit many entering the stream to nirvāṇa, destined for only one more rebirth, no longer subject to rebirth, arhats, or pratyekabuddhas—or else if he were to exhibit bodhisattva great beings, starting from those who have first set their minds on enlightenment; those practicing the perfection of generosity; those practicing the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, {Ki.

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་དང་། ཡན་ལག་དང་ཉིང་ལག་ཡོངས་སུ་གཏོང་བ་དང་། སྤྱད་པར་དཀའ་བའི་སྤྱད་པ་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་ཡོངས་སུ་སྒྲུབ་པ་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོངས་སུ་བསྒྲུབ་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པ་དེ་དག་བསྟན་ཏམ།
en: VIII: 86} and the perfection of wisdom; those practicing all the aspects of emptiness, the factors conducive to enlightenment, the meditative concentrations, the aspects of liberation, the meditative stabilities, and the formless absorptions; those perfecting the first bodhisattva level, and those perfecting [the other bodhisattva levels], up to and including the tenth level; those actualizing the maturity of the bodhisattvas and the extrasensory powers, playing with those extrasensory powers, illuminating the world systems, bringing beings to maturation, refining the buddhafields, sacrificing limbs and appendages, practicing austerities, consummating the powers of the tathāgatas, and consummating the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas; or those actualizing great compassion, or even exhibiting the body of a buddha, with all limbs and appendages completely perfect, those spectators—beings who have the way of being of ordinary people—would think with great astonishment, ‘Oh!

source: སངས་རྒྱས་ཀྱི་སྐུ་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་བསྟན་ན། དེ་ལ་སེམས་ཅན་བྱིས་པའི་ངང་ཚུལ་ཅན་དག་འདི་སྙམ་དུ་སེམས་ཏེ། ཀྱེ་མ་མི་འདིས་ལེགས་པར་བསླབས་པ་ངོ་མཚར་ཆེའི་རེ་མཛེས་དག་བྱེད།
en: What forms of astonishing beauty does this well-trained man create!

source: དེ་ལྟར་སྐྱེ་བོ་དགའ་བར་བྱེད་ཅིང་། གཟུགས་ཀྱི་བྱེ་བྲག་སྣ་ཚོགས་འདི་ལྟ་སྟེ། གླང་པོའི་གཟུགས་དང་། རྟའི་གཟུགས་དང་། སངས་རྒྱས་ཀྱི་སྐུ་ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པའི་བར་དུ་སྟོན་པ་ནི་ངོ་མཚར་ཆེའོ་ཞེས་ངོ་མཚར་ཆེར་འཛིན་ཏོ།
en: He delights the crowd and exhibits a diversity of forms—from the form of an elephant and the form of a horse, up to and including the form of a buddha with all limbs and appendages completely perfect!’ “

source: །འདི་ལྟ་སྟེ་སྐྱེས་བུ་མཁས་ཤིང་གསལ་ལ་ཡིད་རྣོ་བ་དང་ལྡན་པ། དཔྱོད་པ་དམ་པ་དང་ལྡན་པ་རྣམས་ནི་འདི་སྙམ་སྟེ། འདི་ལ་ཆོས་གང་ཡང་དམིགས་སུ་མེད་ན། མི་འདི་དེ་ལྟར་མེད་པའི་ཆོས་ཀྱིས་སྐྱེ་བོ་མང་པོ་འདི་དག་དགའ་བར་བྱེད་པ་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་སོ་སྙམ་སྟེ།
en: Then, there might be some wise and lucid men, sharp-witted and endowed with superior analytical ability, who would think, ‘Since nothing at all can be apprehended in this [illusory act], it is a wonderful and marvelous phenomenon that this man delights this crowd of people with nonexistent phenomena.’

source: སེམས་ཅན་འདི་དག་ནི་དངོས་པོ་མེད་པ་ལ་དངོས་པོར་འདུ་ཤེས་པའོ་ཞེས་བྱ་བར་དེ་དག་གི་ཤེས་པ་འབྱུང་ངོ་།
en: For they know that these beings are perceiving nonentities as entities. “

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཀྱི་དབྱིངས་སུ་མ་གཏོགས་པའི་ཆོས་གང་ཡང་མི་མཐོང་སྟེ།
en: In the same way, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they do not see anything at all outside the realm of phenomena.

source: ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ཀྱང་སེམས་ཅན་དུ་མི་དམིགས།
en: Through skill in means, although they bring beings to maturation, they do not apprehend beings.

source: སེམས་ཅན་དུ་གདགས་པ་ཡང་མི་དམིགས་ཏེ།
en: They do not apprehend anything that is conceived of as a being.

source: བདག་ཀྱང་སྦྱིན་པ་གཏོང་བ་ཡིན། གཞན་ཡང་སྦྱིན་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves dispense generosity and they also encourage others to practice generosity.

source: སྦྱིན་པའི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་སྦྱིན་པ་གཏོང་བ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of generosity, and they also speak in praise of and take empathetic delight in other beings dispensing generosity.

source: བདག་ཀྱང་ཚུལ་ཁྲིམས་སྲུང་བ་ཡིན། གཞན་ཡང་ཚུལ་ཁྲིམས་སྲུང་བ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། ཚུལ་ཁྲིམས་ཀྱི་ལེགས་པ་རྗོད་པ་ཡིན།
en: They themselves maintain ethical discipline, and they also encourage others to maintain ethical discipline.

source: སེམས་ཅན་གཞན་གང་ཚུལ་ཁྲིམས་སྲུང་བ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of ethical discipline, and they also speak in praise of and take empathetic delight in other beings maintaining ethical discipline.

source: བདག་ཀྱང་བཟོད་པ་སྒོམ་པ་ཡིན་གཞན་ཡང་བཟོད་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves cultivate tolerance, and they also encourage others to cultivate tolerance.

source: བཟོད་པའི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་བཟོད་པ་སྒོམ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of tolerance, and they also speak in praise of and take empathetic delight in other beings cultivating tolerance.

source: བདག་ཀྱང་བརྩོན་འགྲུས་རྩོམ་པ་ཡིན། གཞན་ཡང་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves undertake perseverance, and they also encourage others to undertake perseverance.

source: བརྩོན་འགྲུས་ཀྱི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་བརྩོན་འགྲུས་རྩོམ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of perseverance, and they also speak in praise of and take empathetic delight in other beings undertaking perseverance.

source: བདག་ཀྱང་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་ཏིང་ངེ་འཛིན་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves are absorbed in meditative stability, and they also encourage others to engage in meditative stability.

source: ཏིང་ངེ་འཛིན་གྱི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of meditative stability, and they also speak in praise of and take empathetic delight in other beings being absorbed in meditative stability. {

source: བདག་ཀྱང་ཤེས་རབ་སྒོམ་པ་ཡིན།
en: Ki.

source: གཞན་ཡང་ཤེས་རབ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། ཤེས་རབ་ཀྱི་ལེགས་པ་རྗོད་པ་ཡིན།
en: VIII: 87} They themselves cultivate wisdom, and they also encourage others to cultivate wisdom.

source: སེམས་ཅན་གཞན་གང་ཤེས་རབ་སྒོམ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: They speak in praise of wisdom, and they also speak in praise of and take empathetic delight in other beings cultivating wisdom. “

source: བམ་པོ་བདུན་ཅུ་པ། བདག་ཀྱང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་འཛིན་པ་ཡིན། གཞན་ཡང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves maintain the paths of the ten virtuous actions and they also encourage others toward the paths of the ten virtuous actions.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་འཛིན་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the paths of the ten virtuous actions, and they also speak in praise of and take empathetic delight in other beings maintaining the paths of the ten virtuous actions.

source: བདག་ཀྱང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་ལ་ཉེ་བར་གནས་པ་ཡིན། གཞན་ཡང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves attend the eightfold observance and they also encourage others [to attend] the eightfold observance.

source: ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་གྱི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱིན་ལ་ཉེ་བར་གནས་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the eightfold observance, and they also speak in praise of and take empathetic delight in other beings attending the eightfold observance.

source: བདག་ཀྱང་བསླབ་པའི་གནས་ལྔ་ཡང་དག་པར་འཛིན་པ་ཡིན། གཞན་ཡང་བསླབ་པའི་གནས་ལྔ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves maintain the five precepts and they also encourage others toward the five precepts.

source: བསླབ་པའི་གནས་ལྔའི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་བསླབ་པའི་གནས་ལྔ་ཡང་དག་པར་འཛིན་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the five precepts, and they also speak in praise of and take empathetic delight in other beings maintaining the five precepts. “

source: བདག་ཀྱང་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་ཡིན་སེམས་ཅན་གཞན་ཡང་བསམ་གཏན་དང་པོ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། བསམ་གཏན་དང་པོའི་ལེགས་པ་རྗོད་པ་ཡིན།
en: They themselves are absorbed in the first meditative concentration and they also encourage other beings toward the first meditative concentration.

source: སེམས་ཅན་གཞན་གང་བསམ་གཏན་དང་པོ་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the first meditative concentration, and they also speak in praise of and take empathetic delight in other beings being absorbed in the first meditative concentration.

source: བདག་ཀྱང་བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་བསམ་གཏན་བཞི་པ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves are absorbed in the second meditative concentration, the third meditative concentration, and the fourth meditative concentration, and they also encourage others toward the fourth meditative concentration [and so forth].

source: བསམ་གཏན་བཞི་པའི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་བསམ་གཏན་བཞི་པ་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན། བདག་ཀྱང་བྱམས་པ་དང་།
en: They speak in praise of the fourth meditative concentration [and so forth], and they also speak in praise of and take empathetic delight in other beings being absorbed in the fourth meditative concentration [and so forth].

source: སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་བཏང་སྙོམས་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། བཏང་སྙོམས་ཀྱི་ལེགས་པ་རྗོད་པ་ཡིན།
en: They themselves are absorbed in loving kindness, compassion, empathetic joy, and equanimity, and they also encourage others toward equanimity [and so forth].

source: སེམས་ཅན་གཞན་གང་བཏང་སྙོམས་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of equanimity [and so forth], and they also speak in praise of and take empathetic delight in other beings being absorbed in equanimity [and so forth].

source: བདག་ཀྱང་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་ཡིན། གཞན་ཡང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves are absorbed in the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception, and they also encourage others toward the sphere of neither perception nor nonperception [and so forth].

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལེགས་བརྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the sphere of neither perception nor nonperception [and so forth], and they also speak in praise of and take empathetic delight in other beings being absorbed in the sphere of neither perception nor nonperception [and so forth]. “

source: བདག་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྒོམ་པ་ཡིན། གཞན་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་ལེགས་པ་རྗོད་པ་ཡིན།
en: They themselves cultivate the thirty-seven factors conducive to enlightenment and they also encourage other beings toward the thirty-seven factors conducive to enlightenment.

source: སེམས་ཅན་གཞན་གང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྒོམ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the thirty-seven factors conducive to enlightenment, and they also speak in praise of and take empathetic delight in other beings cultivating the thirty-seven factors conducive to enlightenment. “

source: བདག་ཀྱང་རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་།
en: They themselves cultivate the three gateways of liberation, {Ki.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་སྒོམ་པ་ཡིན།
en: VIII: 88} the eight aspects of liberation, the nine serial steps of meditative absorption, the five extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, and they also encourage other beings toward the dhāraṇī gateways [and so forth].

source: གཞན་ཡང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་གཟུངས་ཀྱི་སྒོ་རྣམས་སྒོམ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the dhāraṇī gateways [and so forth], and they also speak in praise of and take empathetic delight in other beings cultivating the dhāraṇī gateways [and so forth]. “

source: བདག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: They themselves cultivate the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and they also encourage other beings toward the eighteen distinct qualities of the buddhas [and so forth].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒོམ་པ་ཡིན། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒོམ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the eighteen distinct qualities of the buddhas [and so forth], and they also speak in praise of and take empathetic delight in other beings cultivating the eighteen distinct qualities of the buddhas [and so forth]. “

source: བདག་ཀྱང་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་སྒྲུབ་པ་ཡིན། གཞན་ཡང་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ལ་ཡང་དག་པར་སྐུལ་བ་ཡིན།
en: They themselves actualize the thirty-two major marks of a great person and the eighty excellent minor marks, and they also encourage other beings toward [actualizing] the thirty-two major marks of a great person and the eighty excellent minor marks.

source: མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུའི་ལེགས་པ་རྗོད་པ་ཡིན། སེམས་ཅན་གཞན་གང་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་སྒྲུབ་པ་དེ་དག་གི་ལེགས་པ་རྗོད་ཅིང་འཐུན་པས་དགའ་བར་སྤྱོད་པ་ཡིན།
en: They speak in praise of the thirty-two major marks of a great person and the eighty excellent minor marks, and they also speak in praise of and take empathetic delight in other beings actualizing the thirty-two major marks of a great person and the eighty excellent minor marks. “

source: རབ་འབྱོར་གལ་ཏེ་ཆོས་ཀྱི་དབྱིངས་སྔོན་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན་མ་ཡིན་ནམ། བར་དུ་ཡང་དེ་བཞིན་དུ་མ་ཡིན་དུ་ཟིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་སྟོན་པར་མི་འགྱུར། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པར་མི་འགྱུར། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པར་མི་འགྱུར་ཏེ།
en: Subhūti, if the realm of phenomena were not in the future exactly the same as it was in the past, and if it were not exactly the same in the interim [that is to say, the present], then, when bodhisattva great beings practice the perfection of wisdom, they would not reveal the realm of phenomena to beings through their skill in means, they would not bring beings to maturation, and they would not refine the buddhafields.

source: རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་དེ་སྔོན་ཇི་ལྟ་བར་ཕྱིས་ཀྱང་དེ་བཞིན། བར་དུ་ཡང་དེ་བཞིན་པས་ན། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་སྟོན་ཏོ། །སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: Subhūti, it is because the realm of phenomena will be in the future exactly the same as it was in the past, and is exactly the same in the interim, that when bodhisattva great beings practice the perfection of wisdom, they do reveal the realm of phenomena to beings through their skill in means, they do engage in the conduct of a bodhisattva for the sake of beings, they do bring beings to maturation, and they do refine the buddhafields.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་མཉམ་པ་ཉིད་དུ་བསྟན་པའི་ལེའུ་སྟེ། དྲུག་ཅུ་གསུམ་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: This completes the sixty-third chapter, “The Teaching on Sameness,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་གལ་ཏེ་སེམས་ཅན་ཡང་ཤིན་དུ་དམིགས་སུ་མ་མཆིས་ལ། སེམས་ཅན་དུ་དམིགས་པ་ཡང་མ་མཆིས་ན། སུའི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་པ་ལགས།
en: Chapter 64 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if beings are absolutely not apprehended and indeed not apprehensible as beings, for whose sake do bodhisattva great beings cultivate the perfection of wisdom?” {

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Ki.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཡང་དག་པའི་མཐའ་ཚད་མར་བྱས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་སྟེ།
en: VIII: 89} The Blessed One replied to the venerable Subhūti, “Subhūti, bodhisattva great beings cultivate the perfection of wisdom, having taken the very limit of reality as their standard.

source: རབ་འབྱོར་གལ་ཏེ་ཡང་དག་པའི་མཐའ་ཡང་གཞན་ལ། སེམས་ཅན་གྱི་མཐའ་ཡང་གཞན་ཡིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྒོམ་པར་མི་འགྱུར་ཏེ།
en: Subhūti, if the very limit of reality were one thing and the very limit of beings another, bodhisattva great beings would indeed not cultivate the perfection of wisdom.

source: །རབ་འབྱོར་ཡང་དག་པའི་མཐའ་ཡང་གཞན་མ་ཡིན། སེམས་ཅན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན་པས། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་སྟེ།
en: Subhūti, it is because the very limit of reality is not one thing and the very limit of beings another that bodhisattva great beings do indeed cultivate the perfection of wisdom for the sake of beings.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྒོམ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་དག་པའི་མཐའ་རྣམ་པར་འཁྲུག་པ་མེད་པར་སེམས་ཅན་རྣམས་ཡང་དག་པའི་མཐའ་ལ་འགོད་དོ། །གསོལ་པ།
en: That is to say, bodhisattva great beings who cultivate the perfection of wisdom establish beings in the very limit of reality without disturbing the very limit of reality.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཡང་དག་པའི་མཐའ་ཡང་གཞན་མ་ལགས། སེམས་ཅན་གྱི་མཐའ་ཡང་གཞན་མ་ལགས་ན།
en: Blessed Lord, if the very limit of reality is not one thing and the very limit of beings not another, can the very limit of reality be established in the very limit of reality?

source: ཡང་དག་པའི་མཐའ་ཡང་དག་པའི་མཐའ་ལ་གནས་པར་འགྱུར་རམ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཡང་དག་པའི་མཐའ་ཡང་དག་པའི་མཐའ་ལ་གནས་པར་འགྱུར་ན་ནི། དེས་རང་བཞིན་ལ་རང་བཞིན་གནས་པར་འགྱུར་ཏེ།
en: Blessed Lord, if the very limit of reality could be established in the very limit of reality, then the essential nature would be established in the essential nature.
